In [1]:
import pandas as pd
import plotly_express as px
import matplotlib.pyplot as plt

import sqlalchemy as sq

In [2]:
engine = sq.create_engine('mysql+pymysql://saurabh:saurabh_sql@localhost:3306/uc_davis')

In [3]:
tables = pd.read_sql('SHOW TABLES', con = engine)

In [4]:
tables

   Tables_in_uc_davis
0      athlete_events
1            athletes
2              cities
3             country
4              events
5               games
6              medals
7             regions
8             seasons
9              sports
10       sports_stats
11              teams

# Finding out First season played

In [5]:
first_game = pd.read_sql('''SELECT season_name, city_name, MIN(year) AS `First Game Year`
                            FROM
                                sports_stats,
                                seasons,
                                athletes
                                    INNER JOIN
                                games ON athletes.game_id = games.game_id
                                    INNER JOIN
                                cities ON games.city_id = cities.city_id
                            WHERE
                                seasons.season_id = games.season_id
                            ORDER BY sports_stats_id;''', 
                            con = engine
)

In [8]:
first_game

  season_name  city_name  First Game Year
0      Summer  Barcelona             1896

# How many medals were distributed?

In [9]:
total_medal = pd.read_sql(
    '''
    SELECT 	
        COUNT(Medal) AS `Total Medal Distributed`
    FROM
	    athlete_events
    WHERE Medal IS NOT NULL;
    ''',
    con = engine
)

In [10]:
total_medal

   Total Medal Distributed
0                    39783

# Lists of Sports Events played in first game(1896)

In [11]:
games_list = pd.read_sql(
    '''
    SELECT DISTINCT (sport_name)
    FROM
        sports_stats,
        sports,
        athletes
            INNER JOIN
        games ON athletes.game_id = games.game_id
            INNER JOIN
        cities ON games.city_id = cities.city_id
    WHERE
        games.year = 1896
    ORDER BY sport_name;
    ''',
    con = engine
)

In [12]:
games_list

          sport_name
0        Aeronautics
1      Alpine Skiing
2           Alpinism
3            Archery
4   Art Competitions
..               ...
61        Tug-Of-War
62        Volleyball
63        Water Polo
64     Weightlifting
65         Wrestling

[66 rows x 1 columns]

We can see that 66 sports were played in first Games in the year 1896

# Country with highest players

In [ ]:
games_list = pd.read_sql(
    '''
    SELECT 
        country_name, COUNT(country_name)
    FROM
        Regions
    GROUP BY country_name
    ORDER BY COUNT(country_name) DESC;
    ''',
    con = engine
)

# Some Statistics

In [ ]:
avg_age = pd.read_sql(
    '''
    SELECT 
        AVG(athlete_age) AS `Avg Age`
    FROM
        sports_stats;
    ''',
    con = engine
)

In [ ]:
avg_weight = pd.read_sql(
    '''    
    SELECT 
        AVG(athlete_weight) AS `Avg Weight`
    FROM
        sports_stats;
    ''',
    con = engine
)

In [ ]:
avg_height = pd.read_sql(
    '''    
    SELECT 
        AVG(athlete_height) AS `Avg Height`
    FROM
        sports_stats;
    ''',
    con = engine
)